# Introduction to Python  

## Pandas Intro

Some examples from [here](https://towardsdatascience.com/40-examples-to-master-pandas-c69d058f434e)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os
%matplotlib inline

## Pandas Data Structures: [Series](https://pandas.pydata.org/pandas-docs/stable/reference/series.html)

Creating Series

In [2]:
obj = pd.Series([4, 12, -5, 3, 5])
obj

0     4
1    12
2    -5
3     3
4     5
dtype: int64

In [3]:
#dir(obj)

Exporting to Numpy array

In [4]:
obj.values

array([ 4, 12, -5,  3,  5], dtype=int64)

Examining the index object

In [5]:
obj.index

RangeIndex(start=0, stop=5, step=1)

Redefining the index

In [6]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan', 'Fernie']
obj

Bob        4
Steve     12
Jeff      -5
Ryan       3
Fernie     5
dtype: int64

Creating series and passing the inidex as parameter

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

Slicing and accessing elements in the series

In [8]:
obj2['c']

3

In [9]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

Slicing using boolean expressions

In [10]:
obj2[obj2 < 0]

a   -5
dtype: int64

Scalar operations with the series

In [11]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [12]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Creating Series from dictionaries

In [13]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [14]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

isnull() and notnull() methods

In [15]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [16]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [17]:
obj3.add(obj4, fill_value=10)

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah            5010.0
dtype: float64

In [18]:
obj4.name = 'Population'
obj4.index.name = 'State'
obj4

State
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

## Pandas Data Structures: [Date Time Range](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.date_range.html)

Specify start and end, with the default daily frequency.

In [19]:
ts_idx1 = pd.date_range(start='1/1/2018', end='1/08/2018')
ts_idx1

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
              dtype='datetime64[ns]', freq='D')

Specify start and periods, the number of periods (days).

In [20]:
ts_idx2 = pd.date_range("20160101", periods=10, freq='D')
ts_idx2

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06', '2016-01-07', '2016-01-08',
               '2016-01-09', '2016-01-10'],
              dtype='datetime64[ns]', freq='D')

Specify end and periods, the number of periods (days).

In [21]:
ts_idx3 = pd.date_range(end='1/1/2018', periods=8)
ts_idx3

DatetimeIndex(['2017-12-25', '2017-12-26', '2017-12-27', '2017-12-28',
               '2017-12-29', '2017-12-30', '2017-12-31', '2018-01-01'],
              dtype='datetime64[ns]', freq='D')

Specify start, end, and periods; the frequency is generated automatically (linearly spaced).

In [22]:
ts_idx4 = pd.date_range(start='2018-04-24', end='2018-04-27', periods=3)
ts_idx4

DatetimeIndex(['2018-04-24 00:00:00', '2018-04-25 12:00:00',
               '2018-04-27 00:00:00'],
              dtype='datetime64[ns]', freq=None)

Other parameters

In [23]:
pd.date_range(start='1/1/2018', periods=5, freq='M')

DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
               '2018-05-31'],
              dtype='datetime64[ns]', freq='M')

In [24]:
pd.date_range(start='1/1/2018', periods=5, freq='3M')

DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
               '2019-01-31'],
              dtype='datetime64[ns]', freq='3M')

In [25]:
pd.date_range(start='1/1/2018', periods=5, tz='Europe/Lisbon')

DatetimeIndex(['2018-01-01 00:00:00+00:00', '2018-01-02 00:00:00+00:00',
               '2018-01-03 00:00:00+00:00', '2018-01-04 00:00:00+00:00',
               '2018-01-05 00:00:00+00:00'],
              dtype='datetime64[ns, Europe/Lisbon]', freq='D')

In [26]:
pd.date_range(start='2017-01-01', end='2017-01-04', inclusive=None)

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04'], dtype='datetime64[ns]', freq='D')

In [27]:
pd.date_range(start='2017-01-01', end='2017-01-04', inclusive='left')

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03'], dtype='datetime64[ns]', freq='D')

In [28]:
pd.date_range(start='2017-01-01', end='2017-01-04', inclusive='right')

DatetimeIndex(['2017-01-02', '2017-01-03', '2017-01-04'], dtype='datetime64[ns]', freq='D')

## Pandas Data Structures: [Dataframe](https://pandas.pydata.org/pandas-docs/stable/reference/frame.html)

Creating Dataframe from a dictionary of lists

In [29]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [30]:
#dir(frame)

In [31]:
print(type(frame))

<class 'pandas.core.frame.DataFrame'>

In [32]:
print(type(frame['state']))

<class 'pandas.core.series.Series'>

Specifying the names of columns

In [33]:
d = pd.DataFrame(data, columns=['year', 'state', 'pop'])
d

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

Making a column as the index

In [34]:
d.set_index('year', inplace=True, drop=False)
d

      year   state  pop
year
2000  2000    Ohio  1.5
2001  2001    Ohio  1.7
2002  2002    Ohio  3.6
2001  2001  Nevada  2.4
2002  2002  Nevada  2.9

Dropping a column

In [35]:
d.drop('year', axis=1, inplace=True)
d

       state  pop
year
2000    Ohio  1.5
2001    Ohio  1.7
2002    Ohio  3.6
2001  Nevada  2.4
2002  Nevada  2.9

Dropping one or some lines

In [36]:
d.drop(2000, axis=0, inplace=False)
d

       state  pop
year
2000    Ohio  1.5
2001    Ohio  1.7
2002    Ohio  3.6
2001  Nevada  2.4
2002  Nevada  2.9

In [37]:
d.drop(2000, axis=0, inplace=True)
d

       state  pop
year
2001    Ohio  1.7
2002    Ohio  3.6
2001  Nevada  2.4
2002  Nevada  2.9

Slicing by column / index

In [38]:
d['pop']

year
2001    1.7
2002    3.6
2001    2.4
2002    2.9
Name: pop, dtype: float64

In [39]:
d.loc[:,'pop']

year
2001    1.7
2002    3.6
2001    2.4
2002    2.9
Name: pop, dtype: float64

In [40]:
d.loc[2001]

       state  pop
year
2001    Ohio  1.7
2001  Nevada  2.4

In [41]:
d.loc[[2001,2002], ["state", "pop"]]

       state  pop
year
2001    Ohio  1.7
2001  Nevada  2.4
2002    Ohio  3.6
2002  Nevada  2.9

In [42]:
d.iloc[[0,1],[1]]

      pop
year
2001  1.7
2002  3.6

In [43]:
d.iloc[0:3,[0,1]]

       state  pop
year
2001    Ohio  1.7
2002    Ohio  3.6
2001  Nevada  2.4

Accessing index and columns objects

In [44]:
d.index

Int64Index([2001, 2002, 2001, 2002], dtype='int64', name='year')

In [45]:
d.columns

Index(['state', 'pop'], dtype='object')

Using alternate notation to access columns as a property

In [46]:
d['state']

year
2001      Ohio
2002      Ohio
2001    Nevada
2002    Nevada
Name: state, dtype: object

In [47]:
d.state

year
2001      Ohio
2002      Ohio
2001    Nevada
2002    Nevada
Name: state, dtype: object

Slicing with boolean conditions (&, |, ==, !=)

In [48]:
d = d[(d["state"] != 'Nevada') | (d.index != 2002)]
d

       state  pop
year
2001    Ohio  1.7
2002    Ohio  3.6
2001  Nevada  2.4

Creating Dataframes from existing structures

In [49]:
frame2 = pd.DataFrame(data, 
                      columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

Creating new column

In [50]:
frame2['new'] = 13
frame2

       year   state  pop debt  new
one    2000    Ohio  1.5  NaN   13
two    2001    Ohio  1.7  NaN   13
three  2002    Ohio  3.6  NaN   13
four   2001  Nevada  2.4  NaN   13
five   2002  Nevada  2.9  NaN   13

In [51]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
new        13
Name: three, dtype: object

In [52]:
frame2.loc['three', 'pop']

3.6

In [53]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
new        13
Name: three, dtype: object

In [54]:
frame2.iloc[2,1]

'Ohio'

In [55]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [56]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt  new
one    2000    Ohio  1.5  16.5   13
two    2001    Ohio  1.7  16.5   13
three  2002    Ohio  3.6  16.5   13
four   2001  Nevada  2.4  16.5   13
five   2002  Nevada  2.9  16.5   13

In [57]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt  new
one    2000    Ohio  1.5   0.0   13
two    2001    Ohio  1.7   1.0   13
three  2002    Ohio  3.6   2.0   13
four   2001  Nevada  2.4   3.0   13
five   2002  Nevada  2.9   4.0   13

Creating a column from a series

In [58]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

frame2['debt'] = val
frame2

       year   state  pop  debt  new
one    2000    Ohio  1.5   NaN   13
two    2001    Ohio  1.7  -1.2   13
three  2002    Ohio  3.6   NaN   13
four   2001  Nevada  2.4  -1.5   13
five   2002  Nevada  2.9  -1.7   13

Creating a column from a bolean expression

In [59]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  new  eastern
one    2000    Ohio  1.5   NaN   13     True
two    2001    Ohio  1.7  -1.2   13     True
three  2002    Ohio  3.6   NaN   13     True
four   2001  Nevada  2.4  -1.5   13    False
five   2002  Nevada  2.9  -1.7   13    False

Deleting a column

In [60]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'new'], dtype='object')

In [61]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [62]:
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

C:\Users\WZHRERO\AppData\Local\Temp\1\ipykernel_12036\1664695910.py:1: FutureWarning: The behavior of `series[i:j]` with an integer-dtype index is deprecated. In a future version, this will be treated as *label-based* indexing, consistent with e.g. `series[i]` lookups. To retain the old behavior, use `series.iloc[i:j]`. To get the future behavior, use `series.loc[i:j]`.
  pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [63]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [64]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame4 = pd.DataFrame(pop)
frame4

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [65]:
frame4.loc[2000,'Nevada'] = 2
frame4

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [66]:
frame5 = pd.concat([frame4, frame4], axis=0)
frame5.iloc[3:,1] = 32
frame5

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5
2001     2.4  32.0
2002     2.9  32.0
2000     2.0  32.0

In [67]:
frame5.drop_duplicates(['Nevada'], inplace=True)
frame5

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     2.0   1.5

In [68]:
dates = pd.date_range("20160101", periods=10, freq='D')
dates

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06', '2016-01-07', '2016-01-08',
               '2016-01-09', '2016-01-10'],
              dtype='datetime64[ns]', freq='D')

In [69]:
data = np.random.random((10,3))

In [70]:
data

array([[0.62057899, 0.92265102, 0.06796724],
       [0.68204864, 0.98634618, 0.9223238 ],
       [0.25096272, 0.60512544, 0.9845596 ],
       [0.52432534, 0.38502135, 0.2350593 ],
       [0.90236533, 0.22548462, 0.89707142],
       [0.93334902, 0.62365714, 0.88800572],
       [0.61379304, 0.40478337, 0.68586141],
       [0.18022294, 0.06761642, 0.55401041],
       [0.77374256, 0.80684334, 0.17633511],
       [0.13044358, 0.65882675, 0.86574963]])

In [71]:
column_names = ['Column1', 'Column2', 'Column3']
df = pd.DataFrame(data, index=dates, columns=column_names)
df.head(10)

             Column1   Column2   Column3
2016-01-01  0.620579  0.922651  0.067967
2016-01-02  0.682049  0.986346  0.922324
2016-01-03  0.250963  0.605125  0.984560
2016-01-04  0.524325  0.385021  0.235059
2016-01-05  0.902365  0.225485  0.897071
2016-01-06  0.933349  0.623657  0.888006
2016-01-07  0.613793  0.404783  0.685861
2016-01-08  0.180223  0.067616  0.554010
2016-01-09  0.773743  0.806843  0.176335
2016-01-10  0.130444  0.658827  0.865750

In [72]:
df[1:3]

             Column1   Column2   Column3
2016-01-02  0.682049  0.986346  0.922324
2016-01-03  0.250963  0.605125  0.984560

In [73]:
df['20160104':'20160107']

             Column1   Column2   Column3
2016-01-04  0.524325  0.385021  0.235059
2016-01-05  0.902365  0.225485  0.897071
2016-01-06  0.933349  0.623657  0.888006
2016-01-07  0.613793  0.404783  0.685861

In [74]:
df.loc['2016-01-01':'2016-01-11','Column2']

2016-01-01    0.922651
2016-01-02    0.986346
2016-01-03    0.605125
2016-01-04    0.385021
2016-01-05    0.225485
2016-01-06    0.623657
2016-01-07    0.404783
2016-01-08    0.067616
2016-01-09    0.806843
2016-01-10    0.658827
Freq: D, Name: Column2, dtype: float64

In [75]:
df.iloc[0:11,1]

2016-01-01    0.922651
2016-01-02    0.986346
2016-01-03    0.605125
2016-01-04    0.385021
2016-01-05    0.225485
2016-01-06    0.623657
2016-01-07    0.404783
2016-01-08    0.067616
2016-01-09    0.806843
2016-01-10    0.658827
Freq: D, Name: Column2, dtype: float64

In [76]:
df[(df.index > '20160102') & (df.index < '20160106')]

             Column1   Column2   Column3
2016-01-03  0.250963  0.605125  0.984560
2016-01-04  0.524325  0.385021  0.235059
2016-01-05  0.902365  0.225485  0.897071

In [77]:
df.query('(Column1 < Column2) & (Column1 < Column3)')

             Column1   Column2   Column3
2016-01-02  0.682049  0.986346  0.922324
2016-01-03  0.250963  0.605125  0.984560
2016-01-10  0.130444  0.658827  0.865750

In [78]:
df.loc['20160101':'20160102',['Column1','Column3']]

             Column1   Column3
2016-01-01  0.620579  0.067967
2016-01-02  0.682049  0.922324

In [79]:
df.iloc[3:5, 0:2]

             Column1   Column2
2016-01-04  0.524325  0.385021
2016-01-05  0.902365  0.225485

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 10 entries, 2016-01-01 to 2016-01-10
Freq: D
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  10 non-null     float64
 1   Column2  10 non-null     float64
 2   Column3  10 non-null     float64
dtypes: float64(3)
memory usage: 620.0 bytes

In [81]:
df.describe()

         Column1    Column2    Column3
count  10.000000  10.000000  10.000000
mean    0.561183   0.568636   0.627694
std     0.288533   0.297840   0.348194
min     0.130444   0.067616   0.067967
25%     0.319303   0.389962   0.314797
50%     0.617186   0.614391   0.775806
75%     0.750819   0.769839   0.894805
max     0.933349   0.986346   0.984560

In [82]:
df.sort_index(axis=0, ascending=True,) # inplace=True)

             Column1   Column2   Column3
2016-01-01  0.620579  0.922651  0.067967
2016-01-02  0.682049  0.986346  0.922324
2016-01-03  0.250963  0.605125  0.984560
2016-01-04  0.524325  0.385021  0.235059
2016-01-05  0.902365  0.225485  0.897071
2016-01-06  0.933349  0.623657  0.888006
2016-01-07  0.613793  0.404783  0.685861
2016-01-08  0.180223  0.067616  0.554010
2016-01-09  0.773743  0.806843  0.176335
2016-01-10  0.130444  0.658827  0.865750

In [83]:
df[sorted(df.columns)]

             Column1   Column2   Column3
2016-01-01  0.620579  0.922651  0.067967
2016-01-02  0.682049  0.986346  0.922324
2016-01-03  0.250963  0.605125  0.984560
2016-01-04  0.524325  0.385021  0.235059
2016-01-05  0.902365  0.225485  0.897071
2016-01-06  0.933349  0.623657  0.888006
2016-01-07  0.613793  0.404783  0.685861
2016-01-08  0.180223  0.067616  0.554010
2016-01-09  0.773743  0.806843  0.176335
2016-01-10  0.130444  0.658827  0.865750

In [84]:
df.sort_values(by='Column2')

             Column1   Column2   Column3
2016-01-08  0.180223  0.067616  0.554010
2016-01-05  0.902365  0.225485  0.897071
2016-01-04  0.524325  0.385021  0.235059
2016-01-07  0.613793  0.404783  0.685861
2016-01-03  0.250963  0.605125  0.984560
2016-01-06  0.933349  0.623657  0.888006
2016-01-10  0.130444  0.658827  0.865750
2016-01-09  0.773743  0.806843  0.176335
2016-01-01  0.620579  0.922651  0.067967
2016-01-02  0.682049  0.986346  0.922324

In [85]:
dates1 = pd.date_range("20160101", periods=6)
data1 = np.random.random((6,2))
column_names1 = ['ColumnA', 'ColumnB']

dates2 = pd.date_range("20160104", periods=7)
data2 = np.random.random((7,2))
column_names2 = ['ColumnC', 'ColumnD']

df1 = pd.DataFrame(data1, index=dates1, columns=column_names1)
df2 = pd.DataFrame(data2, index=dates2, columns=column_names2)

In [86]:
df1

             ColumnA   ColumnB
2016-01-01  0.364569  0.026192
2016-01-02  0.681481  0.789605
2016-01-03  0.432382  0.127952
2016-01-04  0.020643  0.493455
2016-01-05  0.633175  0.793677
2016-01-06  0.121498  0.924611

In [87]:
df2

             ColumnC   ColumnD
2016-01-04  0.604786  0.046270
2016-01-05  0.991644  0.821424
2016-01-06  0.582671  0.297681
2016-01-07  0.975846  0.969252
2016-01-08  0.033262  0.392739
2016-01-09  0.999340  0.742183
2016-01-10  0.781941  0.004833

In [88]:
#https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.join.html
df1.join(df2, how='left')

             ColumnA   ColumnB   ColumnC   ColumnD
2016-01-01  0.364569  0.026192       NaN       NaN
2016-01-02  0.681481  0.789605       NaN       NaN
2016-01-03  0.432382  0.127952       NaN       NaN
2016-01-04  0.020643  0.493455  0.604786  0.046270
2016-01-05  0.633175  0.793677  0.991644  0.821424
2016-01-06  0.121498  0.924611  0.582671  0.297681

In [89]:
df1.join(df2, how='right')

             ColumnA   ColumnB   ColumnC   ColumnD
2016-01-04  0.020643  0.493455  0.604786  0.046270
2016-01-05  0.633175  0.793677  0.991644  0.821424
2016-01-06  0.121498  0.924611  0.582671  0.297681
2016-01-07       NaN       NaN  0.975846  0.969252
2016-01-08       NaN       NaN  0.033262  0.392739
2016-01-09       NaN       NaN  0.999340  0.742183
2016-01-10       NaN       NaN  0.781941  0.004833

In [90]:
df1.join(df2, how='outer')

             ColumnA   ColumnB   ColumnC   ColumnD
2016-01-01  0.364569  0.026192       NaN       NaN
2016-01-02  0.681481  0.789605       NaN       NaN
2016-01-03  0.432382  0.127952       NaN       NaN
2016-01-04  0.020643  0.493455  0.604786  0.046270
2016-01-05  0.633175  0.793677  0.991644  0.821424
2016-01-06  0.121498  0.924611  0.582671  0.297681
2016-01-07       NaN       NaN  0.975846  0.969252
2016-01-08       NaN       NaN  0.033262  0.392739
2016-01-09       NaN       NaN  0.999340  0.742183
2016-01-10       NaN       NaN  0.781941  0.004833

In [91]:
df1.join(df2, how='inner')

             ColumnA   ColumnB   ColumnC   ColumnD
2016-01-04  0.020643  0.493455  0.604786  0.046270
2016-01-05  0.633175  0.793677  0.991644  0.821424
2016-01-06  0.121498  0.924611  0.582671  0.297681

In [92]:
df2['ColumnA'] = df1.ColumnA+1   #Example when columns have the same name

df1.join(df2, how='left', rsuffix='_df2')

             ColumnA   ColumnB   ColumnC   ColumnD  ColumnA_df2
2016-01-01  0.364569  0.026192       NaN       NaN          NaN
2016-01-02  0.681481  0.789605       NaN       NaN          NaN
2016-01-03  0.432382  0.127952       NaN       NaN          NaN
2016-01-04  0.020643  0.493455  0.604786  0.046270     1.020643
2016-01-05  0.633175  0.793677  0.991644  0.821424     1.633175
2016-01-06  0.121498  0.924611  0.582671  0.297681     1.121498

In [93]:
del df2['ColumnA']
df3 = df1.join(df2)

# add a column to df to group on
df3['ProfitLoss'] = pd.Series(['Profit', 
                               'Loss', 
                               'Profit', 
                               'Same', 
                               'Profit', 
                               'Loss', 
                               'Profit', 
                               'Profit', 
                               'Same', 
                               'Loss'], index=dates)

In [94]:
df3['Student'] = pd.Series(['Alex',
                            'Alex',
                            'Alex',
                            'Marcos',
                            'Hannah',
                            'Hannah',
                            'Marcos',
                            'Hannah',
                            'Hannah',
                            'Barbara'], index=dates)

In [95]:
df3

             ColumnA   ColumnB   ColumnC   ColumnD ProfitLoss Student
2016-01-01  0.364569  0.026192       NaN       NaN     Profit    Alex
2016-01-02  0.681481  0.789605       NaN       NaN       Loss    Alex
2016-01-03  0.432382  0.127952       NaN       NaN     Profit    Alex
2016-01-04  0.020643  0.493455  0.604786  0.046270       Same  Marcos
2016-01-05  0.633175  0.793677  0.991644  0.821424     Profit  Hannah
2016-01-06  0.121498  0.924611  0.582671  0.297681       Loss  Hannah

In [130]:
groups = df3.groupby('ProfitLoss')#.mean()
groups.mean()

C:\Users\WZHRERO\AppData\Local\Temp\1\ipykernel_12036\1484290518.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  groups.mean()

             ColumnA   ColumnB   ColumnC   ColumnD
ProfitLoss
Loss        0.401490  0.857108  0.582671  0.297681
Profit      0.476709  0.315940  0.991644  0.821424
Same        0.020643  0.493455  0.604786  0.046270

Verifying Python's ordering heuristics

In [97]:
max(['name1', 'name2', 'Name3'])

'name2'

In [98]:
df4 = df3.groupby(['Student','ProfitLoss']).max()
df4

                     ColumnA   ColumnB   ColumnC   ColumnD
Student ProfitLoss
Alex    Loss        0.681481  0.789605       NaN       NaN
        Profit      0.432382  0.127952       NaN       NaN
Hannah  Loss        0.121498  0.924611  0.582671  0.297681
        Profit      0.633175  0.793677  0.991644  0.821424
Marcos  Same        0.020643  0.493455  0.604786  0.046270

In [99]:
df4.index.get_level_values('Student')

Index(['Alex', 'Alex', 'Hannah', 'Hannah', 'Marcos'], dtype='object', name='Student')

In [100]:
df4.loc[('Hannah','Profit'), 'ColumnA']

0.6331752753487677

### [Pandas Useful Functions](https://pandas.pydata.org/pandas-docs/stable/reference/general_functions.html)

In [101]:
df3

             ColumnA   ColumnB   ColumnC   ColumnD ProfitLoss Student
2016-01-01  0.364569  0.026192       NaN       NaN     Profit    Alex
2016-01-02  0.681481  0.789605       NaN       NaN       Loss    Alex
2016-01-03  0.432382  0.127952       NaN       NaN     Profit    Alex
2016-01-04  0.020643  0.493455  0.604786  0.046270       Same  Marcos
2016-01-05  0.633175  0.793677  0.991644  0.821424     Profit  Hannah
2016-01-06  0.121498  0.924611  0.582671  0.297681       Loss  Hannah

### Transpose

In [102]:
df3.T

           2016-01-01 2016-01-02 2016-01-03 2016-01-04 2016-01-05 2016-01-06
ColumnA      0.364569   0.681481   0.432382   0.020643   0.633175   0.121498
ColumnB      0.026192   0.789605   0.127952   0.493455   0.793677   0.924611
ColumnC           NaN        NaN        NaN   0.604786   0.991644   0.582671
ColumnD           NaN        NaN        NaN    0.04627   0.821424   0.297681
ProfitLoss     Profit       Loss     Profit       Same     Profit       Loss
Student          Alex       Alex       Alex     Marcos     Hannah     Hannah

In [103]:
df3.transpose()

           2016-01-01 2016-01-02 2016-01-03 2016-01-04 2016-01-05 2016-01-06
ColumnA      0.364569   0.681481   0.432382   0.020643   0.633175   0.121498
ColumnB      0.026192   0.789605   0.127952   0.493455   0.793677   0.924611
ColumnC           NaN        NaN        NaN   0.604786   0.991644   0.582671
ColumnD           NaN        NaN        NaN    0.04627   0.821424   0.297681
ProfitLoss     Profit       Loss     Profit       Same     Profit       Loss
Student          Alex       Alex       Alex     Marcos     Hannah     Hannah

### [idmin & idmax](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.idxmax.html)

In [104]:
df3['ColumnA'].idxmax()

Timestamp('2016-01-02 00:00:00', freq='D')

In [105]:
df3.loc[df3['ColumnA'].idxmax()]

ColumnA       0.681481
ColumnB       0.789605
ColumnC            NaN
ColumnD            NaN
ProfitLoss        Loss
Student           Alex
Name: 2016-01-02 00:00:00, dtype: object

In [106]:
max(df3['ColumnA'])

0.6814809149010829

In [107]:
df3['ColumnA'].idxmin()

Timestamp('2016-01-04 00:00:00', freq='D')

In [108]:
df3.loc[df3['ColumnA'].idxmin()]

ColumnA       0.020643
ColumnB       0.493455
ColumnC       0.604786
ColumnD        0.04627
ProfitLoss        Same
Student         Marcos
Name: 2016-01-04 00:00:00, dtype: object

In [109]:
min(df3['ColumnA'])

0.020642963069938403

### [Not Equal - ne](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.ne.html)

In [110]:
df = pd.DataFrame()
df['x'] = [0,0,0,0,0,0,1,2,3,4,5,6,7]

df['x'].ne(0)

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7      True
8      True
9      True
10     True
11     True
12     True
Name: x, dtype: bool

### Nsmallest

In [111]:
df['x'].nsmallest(3)

0    0
1    0
2    0
Name: x, dtype: int64

In [112]:
df.nsmallest(3, 'x')

   x
0  0
1  0
2  0

### Nlargest

In [113]:
df['x'].nlargest(3)

12    7
11    6
10    5
Name: x, dtype: int64

In [114]:
df.nlargest(3, 'x')

    x
12  7
11  6
10  5

### Is in

In [115]:
df.isin([0,2]).head(10)

       x
0   True
1   True
2   True
3   True
4   True
5   True
6  False
7   True
8  False
9  False

In [116]:
df[df.isin([0,2])] #.dropna()

      x
0   0.0
1   0.0
2   0.0
3   0.0
4   0.0
5   0.0
6   NaN
7   2.0
8   NaN
9   NaN
10  NaN
11  NaN
12  NaN

In [117]:
df[~df.isin([0,2])].dropna()

      x
6   1.0
8   3.0
9   4.0
10  5.0
11  6.0
12  7.0

In [118]:
# Create a test dataframe
# Untidy dataframe
# x : Subjects
# y : Student names

marks = pd.DataFrame(np.random.randint(0, 100, size = (20,5)), 
                     columns = ['Maths', 'Physics','Chemistry', 'Biology', 'Computer_Science'])

marks['Student'] = ['Student ' + str(i) for i in range(1,21)]
marks['Test'] = np.random.choice(['T1', 'T2', 'T3'], size=len(marks))
marks = marks[['Test','Student','Maths', 'Physics','Chemistry', 'Biology', 'Computer_Science']]

display(marks.head())

  Test    Student  Maths  Physics  Chemistry  Biology  Computer_Science
0   T3  Student 1     93       53         30       14                71
1   T3  Student 2     88        5         62       18                47
2   T3  Student 3     45       86         86       42                57
3   T2  Student 4     20       27         25       60                70
4   T3  Student 5     24       96         12       81                 8

### [Agg](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.agg.html)

In [119]:
marks[['Maths', 'Physics','Chemistry', 'Biology', 'Computer_Science']].agg(['sum', 'min', 'mean'])

        Maths  Physics  Chemistry  Biology  Computer_Science
sum   1169.00   869.00     1036.0   1024.0            921.00
min     18.00     0.00       10.0      0.0              3.00
mean    58.45    43.45       51.8     51.2             46.05

### Group By

In [120]:
grouped = marks.groupby('Test')

In [121]:
for group in grouped:
    print(group[0])
    display(group[1].head())

T1

   Test     Student  Maths  Physics  Chemistry  Biology  Computer_Science
5    T1   Student 6     97        1         85        4                54
7    T1   Student 8     72       39         25       97                35
10   T1  Student 11     66        9         81       87                40
11   T1  Student 12     18       29         72       11                36
14   T1  Student 15     96        0         44       36                51

T2

   Test     Student  Maths  Physics  Chemistry  Biology  Computer_Science
3    T2   Student 4     20       27         25       60                70
6    T2   Student 7     50       16         82       90                60
8    T2   Student 9     29       12         10       94                26
9    T2  Student 10     40       75         32       96                26
12   T2  Student 13     18       63         65       57                29

T3

   Test     Student  Maths  Physics  Chemistry  Biology  Computer_Science
0    T3   Student 1     93       53         30       14                71
1    T3   Student 2     88        5         62       18                47
2    T3   Student 3     45       86         86       42                57
4    T3   Student 5     24       96         12       81                 8
13   T3  Student 14     83       40         66       61                87

In [122]:
grouped['Maths'].mean()

Test
T1    64.857143
T2    40.000000
T3    67.857143
Name: Maths, dtype: float64

In [123]:
grouped2 = grouped.agg({"Student": "nunique"})
grouped2 = grouped2.reset_index()
print(grouped2)

  Test  Student
0   T1        7
1   T2        6
2   T3        7

### Pivot

In [124]:
pivot = marks.pivot(index='Test', columns='Student', values='Chemistry') 
pivot.head()

Student,Student 1,Student 10,Student 11,Student 12,Student 13,Student 14,Student 15,Student 16,Student 17,Student 18,Student 19,Student 2,Student 20,Student 3,Student 4,Student 5,Student 6,Student 7,Student 8,Student 9
Test,,,,,,,,,,,,,,,,,,,,
T1,NaN,NaN,81.0,72.0,NaN,NaN,44.0,NaN,NaN,NaN,42.0,NaN,26.0,NaN,NaN,NaN,85.0,NaN,25.0,NaN
T2,NaN,32.0,NaN,NaN,65.0,NaN,NaN,65.0,NaN,NaN,NaN,NaN,NaN,NaN,25.0,NaN,NaN,82.0,NaN,10.0
T3,30.0,NaN,NaN,NaN,NaN,66.0,NaN,NaN,67.0,59.0,NaN,62.0,NaN,86.0,NaN,12.0,NaN,NaN,NaN,NaN

### [Melt](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.melt.html)

In [125]:
marks.head(10)

  Test     Student  Maths  Physics  Chemistry  Biology  Computer_Science
0   T3   Student 1     93       53         30       14                71
1   T3   Student 2     88        5         62       18                47
2   T3   Student 3     45       86         86       42                57
3   T2   Student 4     20       27         25       60                70
4   T3   Student 5     24       96         12       81                 8
5   T1   Student 6     97        1         85        4                54
6   T2   Student 7     50       16         82       90                60
7   T1   Student 8     72       39         25       97                35
8   T2   Student 9     29       12         10       94                26
9   T2  Student 10     40       75         32       96                26

In [126]:
tidy = pd.melt(marks, id_vars = 'Student', value_name = 'Frequency')
tidy.tail(10)

        Student          variable Frequency
110  Student 11  Computer_Science        40
111  Student 12  Computer_Science        36
112  Student 13  Computer_Science        29
113  Student 14  Computer_Science        87
114  Student 15  Computer_Science        51
115  Student 16  Computer_Science        77
116  Student 17  Computer_Science        38
117  Student 18  Computer_Science        36
118  Student 19  Computer_Science        70
119  Student 20  Computer_Science         3

In [127]:
tidy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Student    120 non-null    object
 1   variable   120 non-null    object
 2   Frequency  120 non-null    object
dtypes: object(3)
memory usage: 2.9+ KB